Módulo: Bibliotecas e APIs (Python)<br>
Lista: Pandas - Series e DataFrames<br>
Data: 08/2021<br>

In [1]:
import pandas as pd

**Q1:** Em um concurso público foram contabilizados os números de pessoas inscritas (até a data inicialmente estabelecida para a inscrição) segundo os níveis de escolaridade: fundamental completo, médio completo, superior completo e pós-graduação completa. Segue abaixo a tabela com os valores observados. <br>
Nível de escolaridade 	Inscritos<br>
Fundamental completo 	451<br>
Médio completo 	627<br>
Superior completo 	292<br>
Pós-graduação completa 	95<br>

Com base na tabela acima, crie uma Series com esses valores e calcule:

(a) O número total de inscritos<br>
(b) Número inscritos que possuem, pelo menos, o superior completo.<br>
(c) Suponha que a inscrição foi prorrogada e, com isso, foi obtido um número adicional de inscrições: 68, 93, 22 e 0 inscritos a mais em cada uma das categorias de escolaridade apresentados na tabela acima (na mesma ordem). Assim, crie uma nova Series com esses valores.<br>
(d) Utilizando as duas Series que você tem, calcule o número total de inscritos após a prorrogação do período de inscrições.

In [3]:
escolaridade = ['Fundamental completo', 'Médio completo', 'Superior completo', 'Pós-graduação completa']
inscritos = [451, 627, 292, 95]
concurso = pd.Series(data=inscritos, index=escolaridade)
print(concurso)

Fundamental completo      451
Médio completo            627
Superior completo         292
Pós-graduação completa     95
dtype: int64

In [5]:
print('a) Inscritos:',concurso.sum())
print('b) Inscritos (pelo menos Superior completo):', concurso['Superior completo'].sum())
concursop = pd.Series(data=[68, 93, 22, 0], index=escolaridade)
print('c) Inscrições após prorrogação:\n', concursop)
concurso_total = concurso + concursop
print('d) Inscrições totais:\n', concurso_total)

a) Inscritos: 1465
b) Inscritos (pelo menos Superior completo): 292
c) Inscrições após prorrogação:
 Fundamental completo      68
Médio completo            93
Superior completo         22
Pós-graduação completa     0
dtype: int64
d) Inscrições totais:
 Fundamental completo      519
Médio completo            720
Superior completo         314
Pós-graduação completa     95
dtype: int64

**Q2:** Uma turma de cinco alunos foi submetida a uma avaliação e a nota de cada um dos alunos é apresentada na tabela abaixo:<br>
Nome do Aluno 	Nota<br>
Wilfred 	2<br>
Abbie 	7<br>
Harry 	5.5<br>
Julia 	10<br>
Carrie 	6.2<br>

(a) Crie uma Series com os valores da tabela acima.<br>
(b) Retorne o número de alunos que foram aprovados (considerando que a nota mínima para a aprovação é 7).<br>
(c) Qual foi a nota média da turma.<br>
(d) Obtenha o nome dos alunos que tiraram notas acima da média da turma.<br>

In [6]:
# a)
notas = pd.Series(data=[2, 7, 5.5, 10, 6.2], index=['Wilfred', 'Abbie', 'Harry', 'Julia', 'Carrie'])
notas

Wilfred     2.0
Abbie       7.0
Harry       5.5
Julia      10.0
Carrie      6.2
dtype: float64

In [7]:
print('b) Número de alunos aprovados:',len(notas[notas >= 7]))
print('b) Número de alunos aprovados:',notas[notas >= 7].count())

b) Número de alunos aprovados: 2
b) Número de alunos aprovados: 2

In [8]:
print('c) Nota média da turma:', notas.mean())

c) Nota média da turma: 6.14

In [10]:
print('d) Nome dos alunos acima da média:', list(notas[notas > notas.mean()].index))
print(', '.join(list(notas[notas > notas.mean()].index))) # se preferir

d) Nome dos alunos acima da média: ['Abbie', 'Julia', 'Carrie']
Abbie, Julia, Carrie

**Q3:** Crie um objeto DataFrame que contenha os dados da tabela abaixo, os quais se referem ao peso, altura e idade de cinco pessoas: <br>
Peso (kg) 	Altura (cm) 	Idade<br>
72 	180 	31<br>
80 	170 	21<br>
60 	175 	16<br>
90 	174 	28<br>
100 	185 	23<br>

Com base no DataFrame criado, realize o que pedido nos itens abaixo:<br>

(a) Visualize apenas os dados da coluna que contém a altura das pessoas.<br>
(b) Obtenha a idade média das pessoas.<br>
(c) Obtenha os dados das pessoas que estão abaixo da altura média.<br>
(d) Crie um nova coluna no DataFrame que contenha o IMC (Índice de Massa Corporal) de cada pessoa.<br>
(e) Remova a coluna que contém a idade das pessoas.<br>
(f) Salve esses dados do DataFrame em um arquivo csv.<br>

In [12]:
# Criando o DataFrame
infopessoais =  pd.DataFrame()
infopessoais['Peso'] = [72, 80, 60, 90, 100]
infopessoais['Altura'] = [180, 170, 175, 174, 185]
infopessoais['Idade'] = [31, 21, 16, 28, 23]
infopessoais

   Peso  Altura  Idade
0    72     180     31
1    80     170     21
2    60     175     16
3    90     174     28
4   100     185     23

In [13]:
# a) Visualizando a coluna 'altura'
infopessoais['Altura']

0    180
1    170
2    175
3    174
4    185
Name: Altura, dtype: int64

In [14]:
# b) Média da idade das pessoas
infopessoais['Idade'].mean()

23.8

In [16]:
# c) Dados das pessoas abaixo da altura média
print('Altura média:',infopessoais['Altura'].mean())
infopessoais[infopessoais['Altura'] < infopessoais['Altura'].mean()]

Altura média: 176.8

   Peso  Altura  Idade
1    80     170     21
2    60     175     16
3    90     174     28

In [18]:
# d) nova coluna com o IMC:
infopessoais['IMC'] = round(infopessoais['Peso']/((infopessoais['Altura']/100) ** 2),2)
infopessoais

   Peso  Altura  Idade    IMC
0    72     180     31  22.22
1    80     170     21  27.68
2    60     175     16  19.59
3    90     174     28  29.73
4   100     185     23  29.22

In [19]:
# e) Remover coluna idade 
infopessoais.drop('Idade', inplace=True, axis=1)
infopessoais

   Peso  Altura    IMC
0    72     180  22.22
1    80     170  27.68
2    60     175  19.59
3    90     174  29.73
4   100     185  29.22

In [23]:
# f) salvar arquivo csv
infopessoais.to_csv('peso_altura.csv', index=False)

**Q4:** Carregue, em um objeto DataFrame, o arquivo CSV que você salvou no item (f) da questão anterior. Em seguida,<br>

(a) Crie uma nova coluna que contenha o nome das pessoas (sinta-se à vontade para atribuir os nomes que preferir).<br>
(b) Defina a nova coluna criada (com os nomes) como o índice (index) do seu DataFrame.<br>
(c) Obtenha o nome das pessoas que são classificadas com Sobrepeso (IMC entre 25 e 29,9).

In [25]:
# Carregando o DF
df = pd.read_csv('peso_altura.csv')
df

   Peso  Altura    IMC
0    72     180  22.22
1    80     170  27.68
2    60     175  19.59
3    90     174  29.73
4   100     185  29.22

In [26]:
# a) Inserindo nomes
df['Nome'] = ['Pedro', 'Maria', 'João', 'Ana', 'Joaquim']
df

   Peso  Altura    IMC     Nome
0    72     180  22.22    Pedro
1    80     170  27.68    Maria
2    60     175  19.59     João
3    90     174  29.73      Ana
4   100     185  29.22  Joaquim

In [28]:
# b) Os nomes como índices
df.set_index('Nome',inplace=True)
df

         Peso  Altura    IMC
Nome
Pedro      72     180  22.22
Maria      80     170  27.68
João       60     175  19.59
Ana        90     174  29.73
Joaquim   100     185  29.22

In [29]:
# c) nome das pessoas com sobrepeso (IMC entre 25 e 29,9)
nomes = df[(df['IMC'] >= 25) & (df['IMC'] < 30)].index
list(nomes)

['Maria', 'Ana', 'Joaquim']

**Q5:** Carregue, em um objeto DataFrame, o mesmo dataset que você salvou na Questão 3. Em seguida,

(a) Adicione uma nova coluna nesse DF chamada Classificação, que contenha a classificação de cada indivíduo, de acordo com o seu IMC. Para isso, consulte a tabela abaixo.<br>
IMC 	Classificação 	Obesidade (grau)<br>
Menor que 18,5 	Magreza 	0<br>
Entre 18,5 e 24,9 	Normal 	0<br>
Entre 25,0 e 29,9 	Sobrepeso 	I<br>
Entre 30,0 e 39,9 	Obesidade 	II<br>
Maior que 40,0 	Obesidade Grave 	III<br>

(b) Salve em DataFrame no formato xlsx.

In [30]:
df = pd.read_csv('peso_altura.csv')
df

   Peso  Altura    IMC
0    72     180  22.22
1    80     170  27.68
2    60     175  19.59
3    90     174  29.73
4   100     185  29.22

In [32]:
# a) fazendo a classificação do IMC segundo os critérios:

faixas = [0, 18.5, 24.9, 29.9, 39.9, 40]
classificacao = ['Magreza', 'Normal', 'Sobrepeso', 'Obesidade', 'Obesidade grave']

df['Classificação'] = pd.cut(df['IMC'], bins=faixas, labels=classificacao)
df

   Peso  Altura    IMC Classificação
0    72     180  22.22        Normal
1    80     170  27.68     Sobrepeso
2    60     175  19.59        Normal
3    90     174  29.73     Sobrepeso
4   100     185  29.22     Sobrepeso

In [34]:
grau = [0,'0','I','II','III']
df['Grau'] = pd.cut(df['IMC'], bins=faixas, labels=grau)
df

   Peso  Altura    IMC Classificação Grau
0    72     180  22.22        Normal    0
1    80     170  27.68     Sobrepeso    I
2    60     175  19.59        Normal    0
3    90     174  29.73     Sobrepeso    I
4   100     185  29.22     Sobrepeso    I

In [35]:
# b) Salvar em xlsx
df.to_excel('IMC_classificado.xlsx')